!
"
#
$1
$11
$16.7
$170
$2.1
$24.8
$300
$350
$4.1
$7.68
%
(
(AI)
(R&D)
)
+
,
-
.
/
1.6
10
10%
10-year
10.0
10.1
10.8
10.9
1024-bit
11
1100
1101
1103
12
120
14-nanometer
15
1903
1969
1970
1970s
1971
1972
1973
1975
1980s
1981
1982
1983
1984
1985
1987
1990s
1991
1999
2
2.5-Inch
20
2001
2002
2010
2011
2012
2013
2014
2015
2016
2017
2018
2019
21
22
240
250
256-bit
264
29
29.856
290X
3
3.1
3.6
30%
3101
32
32-bit
320
3301
360
365
386
4
4004
432
450-millimeter
4th
5%
50
500
500-series
508
512
6.00
60
64-bit
7850
8
8.1
80286
9
9.0
90
970
9700
:
;
?
@2.90GHz
A
AGP
AMD
ASA
ASCI
ASICs
ASML
ATI
Accelerated
According
Acronis
Adapter
Addendum
Adobe
Advanced
After
Akaemi
Also
Altera
Although
Alto
Aluminum
Amazon
America
American
An
Android
Andy
Announced
Any
Apple
Apricon
April
Are
As
At
Atlanta
August
Australia
B940
Bangalore
Big
Bridge
Busicom
By
CCLeaner
CCleaner
CEO
CPU
CPUs
Cablevision
Cairo-based
California
Can
Capital
Catalina
Celeron
Celerons
China
Chkdsk
Chrome
Cisco
Clara
Clone
Cloning
Communications
Compliance
Computer
Considerable
Cool
Corporation
Costa
Create
CrossFire
DC
DRAM
December
Delaware
Dell
Development
Devices
Did
Direct3D
Dutch
EC
EE
EUR3.3
Edge
Electronics
Electrotechnical
Emerging
Enclosure
Entertainment
Europe
Even
Exact
Excel
Explorer
Express
FPGA
FREE
Facebook
Fairchild
February
Finance
Firefox
Firewalls
Five
For
Fulcrum
GB
GB/s
GHz
GPU
GPUs
GTX
Galaxy
GeForce
Gear
German
Google
Gordon
Graphics
Greetings
Group
Grove
H
HD
HDD
HP
Hmm
Holding
Home
Hope
However
I
IBM
IBM's
IGPs
III
IP
IRPStackSize
If
Image
In
Inc.
India
Indisys
Indysis
Infineon
Infineon's
Inside
Intel
Intel's
Interactive
Internet
Israeli
Israeli-based
It
Its
J.D.Howard
JAWS
JETPLOW
January
Japan
Japanese
Jerusalem
Jobs
Jolla
July
June
Khronos
Laboratory
Lantiq
Lenovo
Linksys
Linux
Lion
Lisa
Look
Lotus
M.2
M2SA
MB
MOSFET
MPEG-4
Mac
MacPro
Macintosh
Macrium
Magazine
Malaysia
March
Mavericks
McAfee
Mechanic
Media
Mer
Micro
Microsoft
Microsystems
MiniTools
Minister
Mobileye
Moore
Moore's
Mountain
Movidius
Mozilla
NEC
NSA
NV
NVLink
Nervana
Nintendo
North
Not
Note
November
Numerous
Nvidia
OS
October
Office
Omek
On
One
OpenCL
Or
Originally
Outlook
PARC
PC
PC/AT
PCI
PCIe
PCM
PCMark
PIX
PS4
Paragon
PasswordBox
Pentium
Personal
Phone
PlayStation
PlaysForSure
Polaris
Port
Portable
Prefecture
Pro
R300
R9
RAM
ROM
Radeon
Reader
Red
Research
Rica
Rogers
Rs
S
SATA
SDD
SIGNATURES
SLI
SRAM
SSD
Sabrent
Saffron
Sailfish
Samsung
Sandy
Santa
Schottky
Scientific
September
Shield
Shortly
Silicon
Since
Singapore
Skype
SoCs
Solutions
Sony
South
Spanish
Speed
Startups
Steve
Switch
SySDSoft
System
Systems
T
TPG
TTL
TV
TVs
Tab
Tablet
Technologies
Technology
Telmap
Test
That
The
Then
They
ThinkPad
ThinkPads
Time
Times
Tools
Touch
Tsukuba
U
UGREEN
UK
UPC
US$15.3
US$30
Used
User
VR
Valley
Vantage
Various
Version
Video
VoIP
Voice
Vuzix
WMV
Warner
Watanabe
Watch
When
Whenever
Which
While
WholeHogIII
Wii
Will
Win7
Windows
Wintel'
Wireless
With
Word
Works
X
XP
Xbox
Xenon
Xerox
Yahoo!
Yamagata
YouTube
Z
a
abbreviated
ability
able
about
abstraction
accelerate
acceptable
access
accessing
according
account
accounts
acquire
acquired
acquisition
acquisitions
across
actually
added
adopting
advance
advanced
after
agreed
agreement
ahead
aid
all
allow
allowing
allows
almost
along
alongside
already
also
alternate
although
always
am
among
an
and
announced
another
any
anyone
anything
anywhere
app
appears
applications
approval
apps
architecture
are
area
around
arriving
articles
artificial
as
aspects
assembly
assets
associate
at
attention
automotive
autonomous
available
bandwidth
based
basis
be
became
become
been
before
began
being
below
best
best-selling
bestselling
better
between
big
billion
bipolar
bit
bits
blind
both
bought
brand
branding
breaks
browser
browsers
built
buoyed
business
but
button
buy
by
cable
calculations
calculator
called
campaign
can
capability
capable
card
cats
cell
central
centre
centres
change
changed
changing
cheaper
checking
chip
chipmaker
chips
circuitry
circuits
claim
class
classic
clean
cleaning
cleanup
clocked
clone
cloning
co-existed
code
cognitive
colloquially
combination
comment
commercial
commercially
companies
company
company's
compared
competed
competes
competition
competitive
competitors
completed
complex
computer
computer-security
computers
computing
concepts
condition
confirm
confirmed
connection
considered
consists
console
constant
consumer
continuing
control
converters
convinced
copying
cordless
core
corporation
correct
costly
could
created
crore
cure
custom
customers
data
date
deal
decimal
decision
deep-learning
defined
delete
demand
design
designed
designs
desktop
develop
developed
developer
development
devices
did
difference
diode
direct
directories
disclosed
disclosing
disk
distinguished
division
do
does
domestic
dominated
done
dramatically
draw
drives
dropping
dual-core
during
dynamic
e.g
eDRAM
each
earlier
early
editorial
efforts
eighth-generation
email
embarked
embedded
emphasis
employees
end
engineers
enterprises
entry
environment
equipment
error
errors
estimated
etc
even
eventually
exclusive
exist
existing
expanded
expansion
expensive
explains
extended
external
extreme
fabricated
facilities
facility
factors
family
fast
faster
favorable
field-effect
fiercely
files
final
finally
find
firms
first
five-year-old
fix
flagship
focus
foldable
for
format
former
fortuitous
found
founders'
founding
friend
friends
from
full
functionality
fund
fundamental
gaining
game
gaming
gate
gb
gesture-based
get
given
glad
glasses
go
goal
google
graphics
grew
growing
growth
had
half
handed
handheld
handled
happens
hard
hardware
has
have
having
headquartered
headset
helps
here
high-definition
high-end
high-speed
highest
highly
home
hope
hopes
host
household
how
i
i%-3470
iAPX
iOS
iPSC/1
iPSC/2
iPSC/860
iPad
iPhone
ideas
identical
if
image
images
implement
implementations
implemented
implying
improve
improved
in
include
included
includes
including
incorporated
increase
increased
increasing
indicated
industry
information
innovation
install
installed
instead
integrate
integrated
integrating
intelligence
interesting
interface
interfaces
international
into
introduced
introduction
inventor
investment
is
issue
issues
it
its
just
keep
keeps
kernel
known
labeled
language
laptops
large
largest
lasted
later
latest
launched
launching
layer
leader
least
lighting
like
line
list
listed
litany
lithography
locations
log
logic
looking
looping
love
loyalty
m
macOS
machine
machines
macros
made
magnetic-core
main
mainframe
major
majority
make
makes
manages
manual
manufactured
manufacturer
manufacturer.
manufacturers
manufacturing
many
market
marketed
marketing
markets
mass
matching
may
me
mean
means
measuring
media
member
members
memories
memory
messages
metal–oxide–semiconductor
microcomputers
microprocessor
microprocessor,
microprocessors
million
mine
mini
miniaturized
missing
mobile
model
modem
monetary
more
most
motherboard
move
moved
moving
much
multinational
multiple
my
n't
name
named
naming
natural
navigation
nearly
necessary
need
needed
netbooks
network
never
new
no
nomenclature
normal
not
notable
noted
nothing
now
number
numerous
objects
of
official
officially
old
on
once
one
only
open
opened
opening
operate
operating
operations
optimized
options
or
other
others
otherwise
our
out
over
own
part
partially
partnered
past
perform
period
personal
phablets
phone
phones
pixel
planned
plant
plants
platforms
played
please
plus
pool
popular
portability
position
positive
possible
powerful
predicted
presence
president
press
previewed
price
primary
problem
problems
process
processes
processing
processor
processors
produce
produced
product
production
products
professional
profitability
profitable
program
programmable
programs
project
provide
provider
providers
provides
publicly
purchase
purchased
quick
quicker
quickly
random-access
range
rapidly
rating
reached
read-only
read:
reader
realize
receiving
recognition
recommend
recommended
reduced
referring
regard
regedit
register
regulatory
release
released
releases
relevant
removes
repair
repaired
replace
replaced
report
reported
reports
representative
represented
research
restart
restrictions
results
return
revenue
reversing
rival
root
running
runtime
s
said
same
saying
scale
screen
search
second
security
see
seems
select
selection
semiconductor
series
service
services
set
several
shaders
shading
shareholder
shares
shift
shortened
showed
shutdown
significant
silicon
simultaneously
simultaniously
since
single
site
six
size
slot
slow
slowed
slowing
small
smart
smartphones
smartwatches
so
software
sold
sole-source
solutions
solved
some
someone
something
specializing
speed
spreadsheets
stage
stake
standard
started
startup
stated
statement
static
still
stopped
structure
stumbling
stylus
success
successful
successor
such
suite
summarized
supercomputer
supplier
supplies
support
supprots
sure
surely
suspect
suspicion
switches
system
systems
table
tablets
team
techies
technological
technology
telling
terms
test
than
that
the
their
them
then
there
therefore
these
they
thing
think
this
those
threads
three-transistor
through
throughout
tier-one
time
to
told
too
took
tools
transaction
transfer
transistor
tried
triple-core
tvOS
twice
two
typically
ultra-violet
unable
undisclosed
unit
units
unprecedented
until
up
upcoming
update
upon
upset
use
used
user
uses
using
utility
value
valued
values
various
ve
version
versions
vertex
very
vice
video
videos
vision
wafer
want
was
watchOS
way
web
web-standards-based
well
were
what
whereas
whether
which
while
wide
widely
wider
will
winning
wireless
with
within
without
work
working
works
world
world's
worst
worth
would
written
wrong
x64
x86
year
years
you
