!
"
#
$
$1
$11
$16.7
$170
$2.1
$24.8
$300
$350
$4.1
$7.68
%
&
(
(AI)
(R&D)
)
+
,
-
.
..
...
....
......
/
1
1.6
10
10%
10-year
10.0
10.1
10.13.6
10.28
10.8
10.9
100
10000MAH
1024-bit
103
1060
11
1100
1101
1103
118
12
12.6.2002
12.6.3.6
12.6.x
12.7.x
120
123
127V
128
128Gb
13
137
14
14-nanometer
1460ea
15
15.6
150
16
16.04
1650
1660
16:9
17
17-x115dx
18
1867
1886
19
1903
1969
1970
1970s
1971
1972
1973
1975
1980s
1981
1982
1983
1984
1985
1987
1990s
1991
1999
1Tb
1st
1x
2
2.0
2.2
2.23GHz
2.4
2.5
2.5-Inch
20
20/
20/20
2001
2002
2005
2010
2011
2012
2013
2014
2015
2016
2017
2018
2019
20th
21
22
23.8
24.1
240
240V
2415
250
256-bit
264
2666
29
29.856
290X
2x2
3
3,1
3.0
3.1
3.1VER
3.5GHz
3.6
30%
3000
3101
32
32-bit
320
3301
36
360
365
386
3g/4
4
40
400
4004
400W
432
448
450-millimeter
47
4K.
4k
4th
5
5%
5.5GB/s
50
500
500-series
508
51
512
52x
55B7A
6
6-pin
6.00
60
600
600W
60Hz
60Hz)/200
64
64-bit
660
7
7.53.2
700m/80
720p
737S
7850
8
8-pin
8.1
80
8000MAH
80286
825
8x
9
9.0
90
90-minutes
93
94
970
9700
9750
99
:
;
?
@2.90GHz
A
A515
AGAIN
AGP
AL340
AMD
AND
APK
ARM
ASA
ASAP
ASCI
ASICs
ASML
ASUS
AT&T
AT&T.
ATI
ATMs
ATT
ATV
ATV1
ATX
Accelerated
According
Acer
Acers
Acronis
Adapter
Addendum
Adobe
Advanced
Advertisement
After
Again
Against
Age
Air
Akaemi
Albeit
All
Also
Altera
Although
Alto
Aluminum
Amazon
America
American
An
And
Android
Andy
Announced
Any
Anyone
Apex
App
App.io
Apparently
Appetize.io
Apple
Apricon
April
Architect
Are
Arranging
As
Asda
Aslant
Aspect
Aspire
Assistant
Asus
At
At&t
Atlanta
August
Australia
B
B9
B940
BIOS
BQ400
BT
Bandwidth
Bangalore
Basically
Batter
Bear
Because
Before
Besides
BestBuy
Big
Bin
Blu
Bob__B
Boot
Both
Bought
Bridge
Bright
Busicom
But
By
C
C9
CCLeaner
CCleaner
CD
CDs
CEO
CGR
CHEAP
CMS
CNET
CPU
CPUs
CUs
CX
Ca
Cable
Cablevision
Caddied
Cairo-based
California
Can
Capital
Cat6
Cat6a
Catalina
CeC
Celeron
Celerons
Cerny
Check
China
Chkdsk
Chrome
ChromeOS
Chromebook
Chromebooks
Cinema
Cisco
Clara
Clone
Cloning
Code
Color
Come
Communications
Compatible
Complete
Compliance
Compressed
Computer
Connect
Connected
Connectors
Considerable
Cool
Core
Cores
Corporation
Costa
Could
Create
Cricket
CrossFire
Crucial
Crucial.com
Crystal
Currently
Custom
DC
DDR3
DPS-600WBA
DRAM
DU06
DV
DVD
DVR
Dark
Dawn
Days
Dead
Death
December
Deep
Delaware
Deliverance
Dell
Depends
Destiny
Detection
Development
Device
Devices
Did
Die
Direct3D
Dishonored
Disk
Display
Distro
Do
Does
Dogs
Drive
Due
Dutch
Dynamic
E
E620u
EC
EE
EOTF
ES
EUR3.3
Edge
Electronics
Electrotechnical
Element
Emerging
Emulator
Emulators
Enclosure
Energy
Entertainment
Epic
Error
Europe
Even
Eventually
Everything
Evil
Exact
Excel
Expandable
Expansion
Experience
Expert
Explorer
Export
Express
External
Eyefinity
FAM
FPGA
FREE
FX505GM
FX531GT
FX7
Facebook
Fairchild
Fallen
Fallout
Fast
February
Filmmaker
Finance
Fire
Firefox
Firewalls
Firewire
First
Firstly
Five
Flash
For
Fortnite
Fuchsia
Fulcrum
G
G2
G4
G5
G7
G9
GB
GB/s
GDDR6/256-bit
GHz
GM
GPS
GPU
GPUs
GRUB
GS29
GTX
Galaxy
Games
Gaming
GeForce
Gear
German
Getaway
Gimp
Glass
Go
God
Gone
Good
Good2Go
Google
Gordon
Got
Graphics
Gravity
Greetings
Group
Grove
Guake
H
H-3885265P
HATE
HD
HDD
HDMI
HDR
HP
Have
Hello
Help
Here
Hey
Hi
High
Highlights
Hike
Hmm
Holding
Home
Honestech
Hope
Hoping
Horizon
How
However
Huawei
Hunter
I
IBM
IBM's
IGPs
III
IMEI
IO
IP
IQ403
IRPStackSize
ISF
If
Image
Imgur.com
Import
In
Inc.
India
Indisys
Indysis
Infineon
Infineon's
Information
Inside
Install
Installation
Instead
Intel
Intel's
Interactive
Internal
Internet
IoT
Ironically
Is
Israeli
Israeli-based
It
Its
J.D.Howard
J3
JAWS
JETPLOW
Jail
Jailbreak
January
Japan
Japanese
Jedi
Jerusalem
Jobs
Jolla
July
June
Just
K
Khronos
Kingdom
Kodi
Kubuntu
LCD
LG
LTE
Laboratory
Lantiq
Laptop
Lead
Legends
Lenovo
Let
Library.itl
Lighting
Lightning
Like
Link
Linksys
Linus
Linux
Lion
Lisa
Look
Looking
Lotus
M.2
M2SA
MAC
MB
MGS
MHz
MOSFET
MPEG-4
MSI
MVNO
Mac
MacBook
MacPro
Macintosh
Macrium
Macrovision
MadeByGoogle
Magazine
Magenta
Magic
Malaysia
Malwarebytes
Man
Manager
Manual
Many
March
Mark
Mate
Mavericks
May
McAfee
Me
Mechanic
Media
Memory
Mer
Message
Micro
Microsoft
Microsystems
Mid
Might
Mini
MiniTools
Minister
Mint
MobiOneStudios
Mobile
Mobileye
Mode
Monster
Monty
Moon
Moore
Moore's
Moreover
Mountain
Mouse
Movidius
Mozilla
Much
My
NEC
NOT
NSA
NV
NVLink
Nervana
Nest
Netflix
Networking
New
Nintendo
Nioh
No
Nokia
Nominal
North
Not
Note
Notes
Nothing
November
Now
Nowadays
Numerous
Nvidia
O
OLED
OP
OS
OSX
OSes
Obihai
Oct
October
Off
Office
Oh
Omek
On
Once
One
OpenCL
Optical
Or
Orbit
Order
Originally
Otherwise
Outer
Outlook
P
P2421D
P3
P30
PARC
PC
PC/AT
PCI
PCIe
PCM
PCMark
PIX
PLUS
PPI
PRAM
PS
PS4
PS5
PSU
PV
Paizo
Palmcorder
Panasonic
Paragon
Pass
PasswordBox
Peace
Pentium
Personal
Personally
Phone
Photo
PicsArt
Picture
Pixel
Pixelbook
Play
PlayStation
Playlist
PlaysForSure
Please
Plenum
Plus
Polaris
Port
Portable
Position
Power
Prefecture
Prime
Prior
Pro
Processor
Professional
Proffit
Quad
Question
R
R300
R9
RAM
RDNA
ROM
RX570
Radeon
Ratio
Raw
Reader
Realm
Recently
Recycle
Red
Redemption
Research
Reservation
Resident
Retina
Rica
Rog
Rogers
Roll20
Rs
Rtings
Rush
S
S20
S330
S5
S9
SATA
SD
SDD
SDR
SIGNATURES
SLI
SLP
SMT
SOME
SP
SRAM
SSD
SSDs
Sabrent
Safelink
Saffron
Sailfish
Samsung
Sandy
Santa
Saver
Saving
Scan
Schottky
Scientific
Screen
Seeing
Sekiro
September
Settings
Shadows
Sharing
Sharp
Shield
Shortly
Sierra
Silicon
Similar
Since
Singapore
Sky
Skype
Smart
So
SoCs
Solutions
Some
Sometimes
Sony
Sound
South
Spanish
Speed
Spider
Sprint
Staples
Star
Startups
Step
Steve
Storage
Store
Strandhogg
Stranding
Support
Surge
Swift
Switch
SySDSoft
Symptoms
System
Systems
T
TA1124
TB
TFLOPs
TMobile
TPG
TTL
TUF
TV
TVs
Tab
Tablet
Technologies
Technology
Telegram
Telmap
Test
Thank
Thanks
That
The
Then
There
Therefore
These
They
ThinkPad
ThinkPads
This
ThopTV
ThopTv
Though
Throughput
Time
Times
To
Took
Tools
Total
Touch
Tried
TruMotion
Tsukuba
Turned
Twice
Typical
U
U.S.
UEFI
UGREEN
UHD
UK
UPC
US$15.3
US$30
USB
USD
UX501vw
Ubuntu
Ultra
Update
Updating
Use
Used
User
Using
V.
VCR
VHS
VL
VOIP
VPN
VR
VTT
VZW
Valley
Vampyr
Vantage
Various
Vegas
Vein
Version
Very
Video
Viewcam
VoIP
Voice
Vuzix
WAY
WD
WMV
War
Warner
Wars
Watanabe
Watch
Watt
Watts
Way
We
Wearables
Well
What
Whatsapp
When
Whenever
Which
While
WholeHogIII
WiFi
Wifi
Wii
Will
Win10
Win7
Win8
Win8.1
Windows
Wintel'
Wireless
With
Wo
Word
Works
World
Worlds
X
XP
XPS
Xbox
Xenon
Xerox
YEPO
Yahoo!
Yamagata
Yesterday
You
YouTube
Yuanpeng
Z
ZTE
Zen
Zero
Zircon
a
abbreviated
ability
able
about
absolutely
abstraction
abundant
accelerate
acceptable
access
accessible
accessing
accidentally
according
account
accounts
accurate
acquire
acquired
acquisition
acquisitions
across
activated
activities
actually
adapter
adapters
add
added
adding
addition
adequate
admit
adopting
advance
advanced
advertising
advice
advise
affect
affected
affects
afraid
after
again
against
aged
ageing
agencies
ago
agreed
agreement
ahead
aid
all
allow
allowing
allows
almost
alone
along
alongside
already
also
alternate
alternatively
although
always
am
ambitious
among
amount
an
and
android
animated
announced
annoying
another
answer
answers
any
anybody
anymore
anyone
anything
anytime
anywhere
apex
apk
aplogies
app
appear
appears
apple
application
applications
appreciate
appreciated
approval
apps
architecture
are
area
areas
around
arrange
arriving
articles
artificial
as
ashamed
aside
ask
aspects
assembly
assets
assistant
associate
assume
assured
at
attached
attention
audio
authority
automatically
automotive
autonomous
avail
available
avoided
avoiding
awaiting
away
awful
awhile
axis
back
background
backlight
backward
bad
balance
bandwidth
bans
bar
bare
based
basically
basis
battel
battery
battle
be
became
because
become
becomes
been
before
began
begin
behavior
being
believe
below
benchmark
benefits
bereft
beside
best
best-selling
bestselling
bets
better
between
big
bigger
billion
bin
bins
bipolar
bit
bits
black
blame
blank
blind
block
board
bog
book
bookmarked
boot
booted
booting
both
bought
box
brand
branded
branding
breakout
breaks
brend
brighter
brightness
brough
brought
browser
browsers
budget
built
buoyed
burned
burps
business
but
button
buy
buying
by
bytes
c
ca
cable
cables
caddied
calculations
calculator
calibrate
calibration
call
called
calling
camcorder
came
camera
campaign
can
capability
capable
capacity
car
card
carrier
carriers
carries
cartoon
case
casing
cast
cats
cause
causes
causing
cd
cell
central
centre
centres
certain
certainly
challenging
chance
change
changed
changes
changing
channels
character
charge
charged
charger
chassis
cheap
cheaper
cheat
check
checked
checker
checkerboards
checking
chip
chipmaker
chips
chkdsk
choir
choose
circuitry
circuits
claim
claims
class
classic
clean
cleaning
cleanup
clear
clearest
clearing
click
clicking
client
clocked
clone
cloning
closely
closer
cloud
clue
co-existed
code
cognitive
coil
collection
college
colloquially
color
colors
combination
come
comes
coming
comment
commercial
commercially
common
companies
company
company's
compare
compared
comparing
compatibility
compatible
competed
competes
competition
competitive
competitors
complaints
complete
completed
completely
complex
components
computer
computer-security
computers
computing
concepts
condition
confirm
confirmed
confusing
connect
connected
connection
connections
connector
connects
consider
considered
considering
consists
console
constant
consumer
contact
containing
content
continuing
contribute
contributing
control
convert
converter
converters
convinced
cools
copy
copying
copyright
cordless
core
corporation
corporations
correct
cost
costly
costs
could
counter
countries
country
couple
course
cover
covered
covers
create
created
creating
crore
cure
curious
current
currently
custom
customers
d
dark
dashboards
data
date
dated
day
days
ddr4
deal
decade
decide
decided
deciding
decimal
decision
decoration
dedicate
dedicated
deep
deep-learning
default
defective
defined
delete
deleted
deleting
delta
demand
demands
depends
describing
description
design
designed
designs
desktop
desktops
despite
detail
detailed
details
detected
develop
developed
developer
development
developmental
device
devices
dialog
did
differ
difference
differences
different
digit
digital
digitizer
digitizing
digression
dilemma
dimensions
dimmer
diode
dire
direct
directly
directories
disable
disabled
disabling
disappointed
disclosed
disclosing
discuss
discussed
discussion
disk
disks
display
distinguished
distributed
distro
distros
division
do
does
doing
domestic
dominated
done
down
downgraded
downgrading
download
downloaded
downright
dramatically
dramatizations
draw
drive
driver
drivers
drives
dropped
dropping
dual
dual-core
due
dumb
duo
durable
during
dynamic
e.g
eDRAM
each
earlier
early
easy
eating
edit
editing
editorial
effect
efforts
eighth-generation
either
else
email
emails
embarked
embedded
emphasis
employees
emulator
emulators
encourage
end
engaged
engineers
enjoy
enough
enter
enterprises
entry
environment
epic
equipment
error
errors
especially
esque
estimated
etc
even
eventually
ever
every
everyone
everything
exactly
example
excellent
exclusive
exhibiting
exist
existing
expanded
expansion
expensive
experience
expired
explaining
explains
extended
external
extra
extreme
fab
fabricated
face
facebook
facilities
facility
fact
factor
factors
factory
failed
faint
fall
falling
family
fans
far
fast
faster
fault
favorable
favorite
feature
features
feel
fell
few
fhd
fi
field-effect
fiercely
fight
figure
file
files
film
final
finally
find
finder
fine
firewire
firms
first
fit
fits
five-year-old
fix
fixed
flagship
flat
flee
focus
foldable
folder
folk
following
foolish
footage
football
for
forgot
forgotten
form
format
former
formerly
forms
fornite
fortine
fortnite
fortuitous
forum
forums
found
founders'
founding
four
free
frequency
fresh
friend
friends
from
frustrated
full
function
functionality
fund
fundamental
g
g6
g7
gaining
game
gamer
games
gaming
gamma
gamut
garnered
gate
gave
gb
general
generally
genres
gesture-based
get
gets
getting
giant
give
given
gives
giving
glad
glasses
glossy
go
goal
goes
going
gone
good
google
gorilla
got
government
grade
graduating
graphic
graphical
graphics
grayscale
greatly
grew
ground
growing
growth
gtx
guidance
guide
guideline
guidepost
h9
ha
hack
had
half
handed
handful
handheld
handle
handled
hands
happen
happened
happens
hard
harddrive
hardly
hardshell
hardware
has
have
having
hdd
head
headache
headaches
headquartered
headset
heard
heart
helically
help
helps
here
hesitate
hidden
high
high-definition
high-end
high-speed
higher
highest
highly
hindsight
hold
home
honest
hooking
hope
hopefully
hopes
hoping
horrible
host
hotspot
hours
house
household
how
however
hp
https://www.cnet.com/forums/discussions/im-upgrading-some-old-iron-what-would-you-like/
huge
hybernation
i
i%-3470
i.e.
i5
i7
i9
iAPX
iMac
iOS
iPSC/1
iPSC/2
iPSC/860
iPad
iPadian
iPhone
iTunes
icon
idea
ideas
identical
if
ifixit
image
images
imation
immediately
impact
implement
implementations
implemented
implying
impressed
impression
improve
improved
improvements
in
inaccurate
inception
inch
inclined
include
included
includes
including
incompatible
incorporated
incorporates
increase
increased
increasing
indicated
inducing
industry
info
information
innovation
input
inserted
inside
install
installed
installing
instead
integrate
integrated
integrating
intel
intellectual
intelligence
intention
interesting
interface
interfaces
interfere
internal
international
internet
into
introduced
introduction
inventor
invest
investment
invisible
ion
is
issue
issues
it
items
its
itself
jail
job
join
jpeg
just
keep
keeping
keeps
kernal
kernel
key
keyboard
keys
kid
kind
kinda
kindly
knew
know
knowing
knowledge
knowledgeable
known
labeled
language
languages
laptop
laptops
large
larger
largest
last
lasted
later
latest
launch
launched
launching
layer
leader
leak
leaning
learned
lease
least
leave
led
left
legacy
legends
less
let
levels
life
light
lighting
lightly
like
likely
liking
line
link
linked
links
linux
list
listed
listing
litany
lithium
lithography
little
live
ll
loads
local
location
locations
lock
locked
log
logic
long
longer
look
looked
looking
looks
looping
losing
lost
lot
lots
love
low
loyalty
luck
m
m.2
macOS
machine
machines
macros
made
magnetic-core
main
mainframe
major
majority
make
maker
makes
making
management
manages
manual
manually
manufactured
manufacturer
manufacturer.
manufacturers
manufactures
manufacturing
many
map
maps
market
marketed
marketing
markets
mass
matching
matrix
maximum
may
me
mean
means
meant
measured
measuring
media
mediocere
meet
mega
member
members
membership
memories
memory
mention
mentioned
mentioning
menu
merely
message
messages
messaging
messenger
metal–oxide–semiconductor
meter
method
microcomputers
microprocessor
microprocessor,
microprocessors
might
miles
million
min
mind
mine
mini
miniaturized
mint
miss
missing
mission
mm
mo
mobile
mode
model
models
modem
moderately
modes
monetary
month
monthly
moon
mor
more
mortal
mortified
most
mostly
motherboard
move
moved
movie
movies
moving
much
multinational
multiple
multipoint
music
must
my
myself
n
n't
name
named
naming
narrow
narrowed
native
natural
navigation
nearly
necessary
necessity
need
needed
needing
neither
netbooks
netflix
network
never
new
next
nits
no
noise
nomenclature
nope
nor
normal
not
notable
note
note9
notebook
noted
nothing
notice
noticeable
noticed
notices
notifications
now
nt
number
numerous
n’t
object
objects
obviously
occur
occurring
odd
of
off
offers
official
officially
often
old
older
on
once
one
online
only
onto
open
opened
opening
opera
operate
operating
operations
opinions
opted
optical
optimized
option
options
or
order
oriented
original
originally
other
others
otherwise
our
out
outlet
output
outside
outsiders
over
overtaxing
overview
owerheating
own
owned
owner
owners
page
paid
panel
part
partially
particularly
partnered
parts
party
pass
passionate
password
past
paste
patch
patches
patents
pattern
patterns
pay
peaceful
peak
pending
penetrating
people
perfect
perfectly
perform
performance
perhaps
period
permanently
permit
personal
personally
phablets
phone
phones
photo
photos
photoshop
physical
physically
pic
picocell
pics
picture
pictures
piece
pin
pips
pixel
place
plan
plane
planned
plant
plants
plate
platforms
play
playback
played
player
playing
plays
please
plug
plugged
plugging
plugs
plus
png
point
pool
pop
popped
popular
port
portability
ports
position
positive
possibilities
possible
post
posting
postings
posts
power
powered
powerful
pre
predicted
prefer
preferable
premium
prepaid
prepared
preparing
prepping
presence
preset
president
press
presume
pretty
prevent
previewed
previous
previously
price
priced
prices
primary
prior
priors
privacy
pro
probably
problem
problems
procedure
proceed
process
processes
processing
processor
processors
prodoctivity
produce
produced
product
production
productivity
products
professional
profitability
profitable
program
programmable
programming
programs
project
promised
promotional
properly
properties
property
protected
protection
provide
provided
provider
providers
provides
pubg
publicly
publishing
pull
purchase
purchased
push
put
quality
question
quick
quicker
quickly
quite
rail
ram
random-access
range
rapidly
rather
rating
ray
re
reached
read
read-only
read:
reader
real
realize
really
rearrangement
reason
reasonable
reasons
recall
receive
receiving
recently
recognition
recognize
recommend
recommendations
recommended
record
recorder
recording
recover
recovery
recreate
recycle
red
reddish
reduced
reduction
referring
refers
reformatory
regard
regedit
register
registered
regretted
regular
regulatory
related
relatively
release
released
releases
relevant
reliable
reload
remarkably
remember
remote
remove
removed
removes
repair
repaired
replace
replaced
replacement
replacing
reply
report
reported
reports
representative
represented
requirements
requires
rereading
research
reservation
reserved
reset
resets
resolution
resolve
response
rest
restart
restarted
resting
restrictions
result
results
retired
return
revelations
revenue
reversing
review
reviews
rid
right
rights
risks
rival
robust
rollable
room
rooms
root
rows
royal
royalty
rumor
run
running
runs
runtime
s
s540GTX
safeguarded
said
same
sample
samsung
save
saw
say
sayin
saying
scale
scaling
scan
scannow
school
screen
screens
screwed
screwing
search
searching
season
seasons
second
seconds
secure
security
see
seeing
seem
seems
seen
sees
select
selection
self
semiconductor
send
sense
separately
series
serious
serve
service
services
set
setting
settings
several
shaders
shading
shadow
shareholder
shares
she
sheet
shekels
shift
shifted
shipped
shop
shopping
short
shortened
should
shove
showed
showing
shows
shuffled
shut
shutdown
side
significant
silicon
similar
simple
simply
simultaneously
simultaniously
since
single
site
six
size
skip
slight
slightly
slot
slow
slowed
slowing
small
smaller
smart
smartphones
smartwatches
smooth
so
soap
softly
software
sold
sole-source
solution
solutions
solved
some
somebody
someone
something
sometime
sometimes
soon
sorted
sound
sources
space
speak
specializing
specific
specification
specify
specs
sped
speed
spend
spent
spouse
spouses
spreadsheets
ssd
stage
stake
standard
stands
starship
start
start-
started
starts
startup
state
stated
statement
static
statistic
stay
staying
step
stick
still
stock
stop
stopped
store
straight
strange
stream
structure
struggles
student
stuff
stumbling
stumped
stylus
success
successful
successor
such
sudden
suggested
suggestion
suggestions
suite
summarized
super
supercomputer
supplier
supplies
supply
support
supported
supposed
supposedly
supprots
sure
surely
surprise
suspect
suspicion
suspicious
sweaty
switches
symbols
system
systems
ta
table
tables
tablets
take
taken
takes
talk
talk/
tapes
target
te
teach
team
tech
techies
technological
technology
techtober
telegram
tell
telling
tells
term
terminal
terms
test
tested
tests
text
texting
texts
than
thanks
that
the
their
them
then
theoretically
there
therefore
these
they
thing
think
third
this
those
thouasand
though
thought
threads
three
three-transistor
through
throughout
ti
tick
tier-one
till
time
times
tips
to
today
tokens
told
tomorrow
too
took
tool
tools
top
touch
toward
towards
towers
tradition
transaction
transfer
transferring
transistor
tremendously
trial
tried
triple-core
trotling
trouble
troubleshooting
try
trying
turn
turned
turning
tv
tvOS
tweaked
twice
two
type
typically
typing
ubuntu
uh
ultra-violet
unable
unbeliveble
under
understand
undisclosed
unexpected
uni
unified
uninstall
uninstalled
unit
units
unlimited
unlocked
unnecessary
unplugged
unplugging
unprecedented
unsure
until
up
upcoming
update
updated
updates
upgrade
upgrades
upgrading
uploading
upon
upset
us
use
useage
used
useful
user
users
uses
using
usual
utilising
utility
utube
vacation
value
valued
values
variable
variant
variations
various
ve
verses
version
versions
versus
vertex
very
via
vice
video
videos
view
vision
voice
voltage
vs
w
wafer
wait
waits
wall
wallpaper
want
wanted
warning
was
watch
watchOS
watched
watching
wattage
way
we
web
web-standards-based
webcam
website
week
weeks
weigh
welcome
well
went
were
what
whatever
when
where
whereas
whether
which
while
whilst
white
who
whole
why
wi
wide
widely
wider
wife
wifi
will
win7
window
windows
winning
wired
wireless
with
within
without
wo
wondering
work
worked
working
works
world
world's
worry
worrying
worse
worst
worth
would
wound
wrapped
write
written
wrong
x
x64
x86
year
years
yellow
yes
yet
yo
you
your
yours
yourself
zoom
–
‘
’
’m
’s
’ve
“
”
…
