$300
$350
$7.68
(
)
,
10-year
1024-bit
1101
1103
12
1969
1970
1970s
1971
1972
1973
1975
1980s
1983
1987
1990s
1991
2010
2011
2016
256-bit
3101
3301
386
4004
60
64-bit
90
After
Andy
As
At
August
By
CEO
Cairo-based
Capital
China
Considerable
Costa
DRAM
EE
Electrotechnical
Emerging
Fairchild
Fulcrum
Gordon
Grove
However
IBM
IBM's
In
Inc.
India
Infineon
Infineon's
Inside
Intel
Intel's
Israeli
Israeli-based
Its
Japan
Japanese
Jerusalem
July
Laboratory
MOSFET
Malaysia
March
McAfee
Microsystems
Moore
Moore's
October
PC
Pentium
ROM
Rica
SRAM
Schottky
September
Singapore
Solutions
Startups
SySDSoft
TPG
TTL
Technologies
Telmap
The
Times
Tsukuba
While
Wintel'
Wireless
a
ability
able
about
acquire
acquisition
actually
advance
agreed
all
allow
also
among
an
and
announced
applications
approval
around
as
aspects
assembly
assets
associate
available
based
basis
be
become
before
bestselling
billion
bipolar
bought
brand
buoyed
business
but
by
calculations
campaign
cell
central
centres
change
chip
chips
circuitry
circuits
combination
commercial
commercially
company
company's
competition
competitors
complex
computer
computer-security
computers
condition
consumer
continuing
convinced
core
costly
could
created
deal
decision
development
devices
diode
disclosed
distinguished
do
dominated
dramatically
during
dynamic
earlier
early
embarked
embedded
employees
end
engineers
entry
eventually
expanded
facilities
facility
factors
fast
field-effect
firms
first
five-year-old
focus
for
fortuitous
founders'
founding
from
fundamental
gate
goal
grew
growing
growth
had
handed
hardware
high-speed
host
household
implementations
implemented
improved
in
included
including
increased
industry
information
innovation
integrated
integrating
international
into
issues
it
its
known
laptops
large
launching
line
list
logic
loyalty
machines
made
magnetic-core
mainframe
majority
make
manufacturer
manufacturers
manufacturing
many
market
marketing
media
memories
memory
metal–oxide–semiconductor
microcomputers
microprocessor
microprocessor,
microprocessors
million
mini
miniaturized
model
modem
most
multiple
name
navigation
nearly
necessary
needed
netbooks
network
not
notable
of
on
one
only
opened
opening
operations
over
part
past
perform
period
personal
phones
planned
plants
played
position
possible
predicted
price
primary
processes
processing
processors
produced
product
products
profitability
profitable
provide
purchase
purchased
quick
random-access
range
rapidly
reached
read-only
reduced
regulatory
released
replace
replaced
reported
represented
reversing
rival
s
same
security
selection
semiconductor
shift
significant
silicon
since
slow
small
smart
so
software
sold
sole-source
solved
specializing
stake
static
still
structure
success
supplier
switches
tablets
technological
technology
that
the
their
then
these
this
three-transistor
to
too
transaction
transistor
twice
unit
unprecedented
use
used
using
values
various
very
was
what
which
widely
wider
winning
wireless
with
within
world
would
year
